Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ཚེ་རབས་སུ་ཚེ་རབས་དྲན་པར་འགྱུར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བཟུང་ཞིང་བྱིན་གྱིས་བརླབ་པར་འགྱུར། ལུས་རྡོ་རྗེར་འགྱུར།
en: He will be able to remember his successive births, will be taken care of and blessed by all the tathāgatas, and will develop a vajra body.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་ཆུད་པར་འགྱུར། ས་བཅུ་ལ་གནས་པར་ཡང་འགྱུར།
en: He will successively visit all buddha fields and will be established on the ten bodhisattva levels.

source: ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པར་ཡང་འགྱུར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ལུང་བསྟན་པར་ཡང་འགྱུར།
en: He will attain the level of not turning back and will obtain a prophecy from all the tathāgatas about his final awakening. “

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་བསྐྱེད་པར་ཡང་འགྱུར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་སུམ་དུ་སྟོན་པར་འགྱུར།
en: The vidyā holder will plant the roots of every virtue and will be able to see every tathāgata face-to-face.

source: བསོད་ནམས་ཀྱི་ཚོགས་ཐམས་ཅད་བསགས་པར་འགྱུར། སྡིག་པ་དང་། སྒྲིབ་པ་དང་། སྡིག་པ་ཐམས་ཅད་ཡོངས་སུ་དག་པར་འགྱུར།
en: He will accumulate every kind of merit and will purify all his evil, obscurations, and vices.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བའི་དམ་ཚིག་རྟོགས་པ་དང་།
en: He will come to know the secret samaya of the great maṇḍala that possesses the auspiciousness of all the tathāgatas.

source: གསང་བའི་དཀྱིལ་འཁོར་ཆེན་པོའི་དམ་ཚིག་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་མཐར་ཐུག་པའི་བར་དུ་འཚལ་བར་འགྱུར་བ་ལགས་སོ།
en: This will continue until his attainment of the seat of awakening at the end of his journey.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་ལྷ་མོ་ཆེན་མོ་སྒྲོལ་མ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The blessed Tathāgata Śākyamuni applauded the goddess Tārā, saying, “Good!

source: ལྷ་མོ་ཆེན་མོ་ལེགས་སོ་ལེགས་སོ།
en: It is good, O great goddess!

source: །རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་ཁྱོད་ཀྱིས་བཤད་པ་མཆོག་ཏུ་ལེགས་སོ།
en: The king of vidyās that you have now taught is supremely beautiful.

source: །ཆོ་ག་ཞིབ་མོ་འདི་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། རིག་སྔགས་འཆང་དེ་ཡང་ཡོངས་སུ་བསྲུང་བའི་ཕྱིར་དང་། ཡོངས་སུ་བསྐྱང་བའི་ཕྱིར་དང་། དངོས་གྲུབ་རབ་ཏུ་སྦྱིན་པའི་ཕྱིར་ཁྱོད་ཀྱིས་ཡོངས་སུ་བསྐྱང་བར་བྱའོ།
en: You should take care to make the rite fulfill its purpose, to protect and guard its practitioners, and to grant them its accomplishment.”

source: །དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་དང་། ཚོགས་ཀྱི་བདག་པོ་ནག་པོ་ཆེན་པོ་དང་། རིག་སྔགས་འཆང་དང་དཀྱིལ་འཁོར་ཀྱི་ལྷ་དུ་མ་དང་། ནོར་བུ་བཟང་པོའི་བུ་དང་། ལྔས་རྩེན་དང་། གར་མཁན་མཆོག་དང་། སྟོབས་ཅན་དང་། སྟོབས་པོ་ཆེ་དང་། ལྗང་སྔོ་དང་། དུང་ཅན་དང་། དེ་བཞིན་དུ་འཇིགས་བྱེད་དང་། དབྱངས་ལྡན་མ་དང་། དཔེ་མེད་མ་དང་། ལྷ་མོ་ཆེན་མོ་དཔལ་དང་། རལ་པ་གཅིག་མ་དང་། མེ་ཏོག་ཚེམས་ཏེ་ཐམས་ཅད་འདུས་ནས་མཐུན་པར་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་རིག་སྔགས་འཆང་དེ་དང་།
en: Vajrapāṇi, the great general of the yakṣa army, as well as the Four Great Kings, the gods Brahmā, Viṣṇu, and Maheśvara, the lord of gods Śakra, the overlord of gaṇas Mahākāla, and many other deities of the vidyā maṇḍala including Maṇibhadra, Pūrṇabhadra, Pāñcika, Naḍakūbara, Bala, Mahābala, the great goddesses Hārītī, Śaṅkhinī, Bhīmā, Sarasvatī, Anaupamyā, Śrī, Ekajaṭā, and Puṣpadantī, all rose from their seats, draped their robe over their shoulder, knelt on their right knee, bowed down with folded hands in the direction of the Blessed One, and spoke to him as follows. “

source: རིག་སྔགས་སྨྲ་བ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ། གཞན་ཡང་སྐྱེས་པའམ། བུད་མེད་དམ། ཁྱེའུའམ། བུ་མོ་གང་ཞིག་དོན་ཡོད་པའི་ཞགས་པ་གཙུག་ཏོར་འདི་སྒྲུབ་པར་བགྱིད་དམ།
en: O Lord, when the final period arrives, I will also be loyal to all the vidyā holders who recite this vidyā, whether they are a son or a daughter of good family, a monk or a nun, a male or a female lay practitioner, or any other man, woman, boy, or girl who accomplishes this heart essence of Amogha­pāśoṣṇīṣa, reads it aloud, memorizes it, merely learns its name, or upholds it.

source: ཀློག་པར་བགྱིད་དམ། འདོན་ནམ། ཐ་ན་མིང་ཙམ་ཡང་འཛིན་པར་བགྱིད་ན། བཅོམ་ལྡན་འདས་དེ་ལ་བདག་ཅག་ཀུན་ནས་མཐུན་པར་རྟག་ཏུ་རྗེས་སུ་འབྲང་ཞིང་བསྲུང་བར་བགྱི། ཡོངས་སུ་བསྐྱང་པར་བགྱི།
en: I will always be loyal to them, protect them, and guard them.

source: གཟི་བརྗིད་གཞུག་པར་བགྱི། དངོས་གྲུབ་ཆེན་པོའི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི། བསམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་ཡོངས་སུ་རྫོགས་པར་བགྱི།
en: I will fill them with vitality, grant them great success, and fulfill all their wishes and hopes.

source: ཉེས་པར་བགྱིས་པ་ཐམས་ཅད་སོ་སོར་བཟློག་པར་བགྱི། སྡིག་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་སྦྱང་བར་བགྱི།
en: I will stop them from committing any evil actions and cleanse them of all their evil and obscurations.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མཐར་ཐུག་གི་བར་དུ་རྟག་ཏུ་རྗེས་སུ་འབྲང་བར་བགྱིའོ།
en: I will be loyal to them until they attain their final goal, the seat of awakening.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ་གྲོགས་པོ་དག་ལེགས་སོ་ལེགས་སོ།
en: The Blessed One replied, “Good! It is good, friends!

source: །ཁྱོད་ཀྱིས་བྱ་བ་དེ་ལྟར་ཡིན་ཏེ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་ཆེན་པོ་འདི་ངས་གཏམས་ཤིང་ཡོངས་སུ་གཏང་ངོ་ཞེས་བཀའ་སྩལ་ཏོ།
en: This is how you should act. I entrust this king of vidyās to you.”

source: །དོན་ཡོད་པའི་ཞགས་པ་པདྨ་གཙུག་ཏོར་གྱི་རྡོ་རྗེ་ཆེན་པོའི་སྙིང་པོ་གསང་བ་རྫོགས་སོ།། །།
en: This concludes the section on the great, vajra-like, secret heart essence of Amoghapāśa-Padmoṣṇīṣa.

source: རྣམ་པར་ཐར་པ་ཆེན་པོའི་དཀྱིལ་འཁོར་གྱི་སྙིང་པོ་གསང་བ་བསྟན་པ་བཀླགས་པས་གྲུབ་པ་ཆོ་ག་ཞིབ་མོ་རྒྱས་པ་མཆོག་ཏུ་གསང་བ་མཐའ་དག་རྫོགས་པ་ཡོངས་སུ་རྫོགས་སོ།། །།
en: It can be accomplished by merely reading it. The secret heart instructions, the great maṇḍala of liberation, the supremely secret, extensive ritual instructions, presented here in full, have now been completed.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་ནས་མིག་མི་འཛུམས་པར་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་དུ་བལྟས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ན་བདག་ལ་པདྨ་ཡངས་པའི་དཀྱིལ་འཁོར་པདྨའི་རིགས་ཀྱི་སྙིང་པོར་གྱུར་པ་གསང་བ་དེ་ཁོ་ན་ཉིད་བསྟན་པ་མཆིས་ཏེ།
en: Noble Avalokiteśvara, the great bodhisattva being, prostrated himself at the feet of the Blessed One, looked up at his face with unblinking eyes, and said, “There is, Lord, in this great lotus maṇḍala of mine, an instruction on the secret reality that is the very essence of the lotus family.

source: རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་གྱི་གསང་བའི་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ཁྲོ་བོའི་རྒྱལ་པོ་རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་སྙིང་པོ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ངོ་བོ་ཐ་དད་པ་དང་།
en: It constitutes a secret maṇḍala of liberation and the heart essence of Amoghapāśa. I will now teach, in your presence, Lord, the king of vidyās that is the essence of Krodharāja.

source: ཕྱག་རྒྱ་ཐ་དད་པར་དང་། སྔགས་ཐ་དད་པ་དང་། དཀྱིལ་འཁོར་དང་། གཟུགས་བྲི་བ་ཡོངས་སུ་བསྒྲགས་པར་བགྱི།
en: I will teach, one at a time, the essence and auxiliary mantras, the primary maṇḍalas, the mudrās, and the cloth painting.

source: སེམས་ཅན་ཐམས་ཅད་རྗེས་སུ་གཟུང་བའི་སླད་དུ། རིག་སྔགས་འཆང་བ་རྣམས་ཀྱི་དེ་ཁོ་ནར་གྱུར་པ་ནི་འདི་ལགས་ཏེ།
en: I will teach them out of kindness for all beings and to help vidyā holders accomplish the nature of reality.

source: རིག་སྔགས་འཆང་བ་ཐམས་ཅད་ཀྱི་གནས་གསང་བའི་དཀྱིལ་འཁོར་པདྨ་ཡངས་པའི་དམ་ཚིག་དོན་ཡོད་པའི་ཞགས་པ་བསྒྲུབ་པའི་ཆོ་ག་རྗེས་སུ་སྩལ་བར་བགྱི་ན་བཅོམ་ལྡན་འདས་དེ་བདག་ལ་གནང་བར་མཛད་ཅིང་།
en: I will transmit the vast lotus samaya for the secret maṇḍala that is home to all the vidyās and involves various Amoghapāśa practices. Therefore, Lord, please do not object this. “

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་དམ་ཚིག་བྱིན་གྱིས་བརླབས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་རིགས་དང་། པདྨའི་རིགས་དང་། ནོར་བུའི་རིགས་དང་། རྡོ་རྗེའི་རིགས་དང་།
en: This rite is empowered with the secret samaya of the families of all tathāgatas, such as the tathāgata, the lotus, the jewel, and the vajra families.

source: སྤྱིའི་དམ་ཚིག་འགྲུབ་པར་འགྱུར།
en: It successfully establishes the samaya with all these families equally.

source: སྤྱིའི་བྱིན་གྱིས་བརླབས་དང་། རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་དང་། གཟུགས་བྲི་བ་དང་། ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བ་ལ་རྗེས་སུ་འཇུག་པར་འགྱུར། ཆོ་ག་ཞིབ་མོ་སྒྲུབ་པ་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་དེ་ཁོ་ན་ཉིད་དུ་འགྱུར།
en: The families enter the collection of the maṇḍalas, the cloth painting, and the mudrās of the king of vidyās, bestowing the blessing of all the families equally.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དང་། བྱང་ཆུབ་སེམས་དཔའི་དཀྱིལ་འཁོར་དུ་འཇུག་པའི་དམ་ཚིག་བྱིན་གྱིས་བརླབས་ཀྱི་དེ་ཁོ་ན་ཉིད་དུ་འགྱུར་ལགས་སོ།
en: Following entry into the maṇḍala of all the tathāgatas and bodhisattvas who dwell in the buddha fields, the samaya is truly established.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དོན་ཡོད་པའི་ཞགས་པའི་དམ་ཚིག་རྣམ་པར་ཐར་པ་ཆེན་པོའི་དཀྱིལ་འཁོར་རྣམ་པར་འཕྲུལ་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དམ་ཚིག་དཀྱིལ་འཁོར་ཆེན་པོ་དང་། ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བ་ཆོ་ག་ཞིབ་མོ་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་ཤོད་ཅིག །
en: The blessed Tathāgata Śākyamuni, the worthy one, the fully realized Buddha, replied to Noble Avalokiteśvara, the great bodhisattva being, “Most compassionate one, if you think that the time is right, please teach this great maṇḍala of liberation that involves the samaya of Amoghapāśa.

source: ངས་བྱིན་གྱིས་བརླབས་ཤིང་རྗེས་སུ་ཡི་རང་ལ་ཕྱག་རྒྱ་ཆེན་པོས་བཏབ་ནས་བྱིན་གྱིས་བརླབས་སོ།
en: The rite is a collection of great maṇḍalas and mudrās, a miraculous manifestation of the samaya of all bodhisattvas that all former tathāgatas have blessed, joyfully approved of, and sealed with the great seal.

source: སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་དགུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་བརླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་སོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་དེ་ཁོ་ན་ཉིད་ཀྱི་དངོས་གྲུབ་བླ་ན་མེད་པ་ཕྱག་རྒྱ་དང་།
en: In order to benefit beings, it was blessed by hundreds of thousands of millions of billions of tathāgatas, as numerous as the grains of sand in ninety-nine Gaṅgā rivers.

source: དཀྱིལ་འཁོར་དང་། དམ་ཚིག་ཆེན་པོར་བྱིན་གྱིས་བརླབས་སོ།
en: With its collection of maṇḍalas and mudrās, it is blessed with the great samaya that brings the supreme realization of reality.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བཞིན་འཛུམ་ཞིང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བ་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་རྣམ་པར་འཕྲུལ་པ་བཀོད་པ། དོན་ཡོད་པ་མཐོང་བའི་ཏིང་ངེ་འཛིན་མངོན་དུ་བྱས་ནས་ཏིང་ངེ་འཛིན་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་འོད་ཟེར་གྱིས་སྣང་བར་བྱས། ལྷའི་གནས་ཐམས་ཅད་སྣང་བར་བྱས། ཀླུའི་གནས་ཐམས་ཅད་སྣང་བར་བྱས།
en: Noble Avalokiteśvara, the great bodhisattva being, then smiled as he entered the samādhi called the amogha view of the magical display of the secret maṇḍala of liberation of all the tathāgatas, by means of which he illuminated the world spheres in the great trichiliocosm and all the buddha fields with rays of light.

source: གནོད་སྦྱིན་དང་སྲིན་པོའི་གནས་ཐམས་ཅད་སྣང་བར་བྱས། འབྱུང་པོའི་གནས་ཐམས་ཅད་སྣང་བར་བྱས། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་།
en: He illuminated all the abodes of devas, nāgas, yakṣas, rākṣasas, bhūtas, asuras, garuḍas, kinnaras, and mahoragas.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་གནས་ཐམས་ཅད་སྣང་བར་བྱས། སའི་འོག་ཏུ་གཏོགས་པ་འོག་ན་གནས་པ་ཐམས་ཅད་སྣང་བར་བྱས། བར་སྣང་གི་གནས་ནམ་མཁའ་ལ་རྒྱུ་བའི་ལྷ་རྣམས་སྣང་བར་བྱས་ཤིང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ནས་གཡོ་བ་ཆེན་པོར་གྱུར་པ་དང་།
en: He illuminated the abodes of the inhabitants of the subterranean paradises and the abodes of the deities in the intermediate region who travel through space. A great quake was then felt in world spheres throughout the great trichiliocosm.

source: གཡོ་བའི་མཐུ་དེས་དེ་དག་ཐམས་ཅད་བསྐུལ་བར་གྱུར་ཏོ། །བསྐུལ་བ་ཙམ་གྱི་མོད་ཉིད་ལ། དེ་དག་ཐམས་ཅད་ལྷགས་ཏེ། རི་གྲུ་འཛིན་ན་འཁོར་མང་པོ་འདུས་པར་མཐུན་པར་ལྷགས་ནས་འཁོད་དོ།
en: The power of this earthquake incited all the beings there, who immediately hastened together to Potala Mountain and took their seats among the great assembly there.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་འཁོར་མང་པོ་འདུས་པར་མཁྱེན་ནས་དོན་ཡོད་པའི་ཞགས་པའི་ཆ་བྱད་དུ་ཞུགས་ཤིང་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས།
en: Noble Avalokiteśvara, the great bodhisattva being, seeing the great assembly gathered together, stood before the Blessed One.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཐམས་ཅད་དུ་རིགས་སྤྱིའི་དམ་ཚིག་གི་ཚུལ་དུ་ཞུགས་ལ། རལ་པའི་ཐོར་ཚུགས་ཀྱིས་བརྒྱན་ཞིང་།
en: He had the form and attire of Amoghapāśa, which was compatible with the secret samaya that binds all tathāgata families equally.

source: རྒྱལ་བ་འོད་དཔག་མེད་ཐོར་ཚུགས་སུ་ཐོགས་པ། ཚངས་པའི་གཟུགས་ཅན་ཕྱག་བཅོ་བརྒྱད་པ་རང་གི་ངོ་བོ་ཞགས་པ་ཐོགས་པ། ཐལ་མོ་སྦྱར་བ། སྐུ་ཕྱེད་ན་ཕྱག་གཡོན་པ་བརྟེན་པ། མདུང་རྩེ་གསུམ་པ་བསྣམས་པ། རིལ་བ་སྤྱི་བླུགས་དང་། བགྲང་ཕྲེང་བསྣམས་པ། པདྨ་བསྣམས་པ། པདྨའི་ཕྱག་རྒྱ་བསྣམས་པ། ཡིད་བཞིན་གྱི་ནོར་བུ་དང་། རྒྱལ་མཚན་བསྣམས་པ། མེ་ཏོག་གི་ཕུར་མ་དང་། བཱི་ཛ་པཱུ་ར་བསྣམས་པ། དབུགས་འབྱིན་པར་མཛད་པ།
en: His topknot was adorned with a diadem that supported the victorious Amitābha, and his hallowed body had eighteen arms, one of which held the hallmark noose.

source: རིན་པོ་ཆེའི་ཆར་འབེབས་པར་མཛད་པ། ཐལ་མོ་སྦྱར་བའི་ཕྱག་རྒྱ་མཛད་པ། སྤྱི་བོར་ཕྱག་རྒྱ་མཛད་པ། དམ་ཚིག་གི་ཕྱག་རྒྱ་མཛད་པ། པདྨ་ཡངས་པའི་ཕྱག་རྒྱ་མཛད་པ། རྡོ་རྗེའི་རིགས་ཀྱི་དམ་ཚིག་གི་ཕྱག་རྒྱ་མཛད་པ། དེ་བཞིན་གཤེགས་པ་དང་། ནོར་བུའི་ཕྱག་རྒྱ་མཛད་པ།
en: One pair of his hands was joined in the añjali gesture, one of his left hands was placed on his waist, and the rest of his hands held a trident, a water pot, a rosary, and a lotus, displayed a lotus mudrā, held a wish-fulfilling jewel, a banner, a vase with flowers, and a citron, displayed a gesture of encouragement, discharged a rain of jewels, and displayed the head mudrā, the samaya mudrā, the mudrā of the great lotus, the samaya mudrā of the vajra family, the mudrā of the tathāgata family, and the mudrā of the jewel family.

source: གཟུགས་ཞི་བ། སྤྱན་གསུམ་པ། མཆོད་ཕྱིར་ཐོགས་པ། གདན་པདྨ། སྐུ་འོད་ཟེར་སྣ་ཚོགས་འབར་བ།
en: Of peaceful form, he had three eyes, wore a sacred thread, sat on a lotus seat, and emitted light of various colors from his body.

source: སྒྲོལ་མ་བདུན་རྗེས་སུ་འབྲང་བ། ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུས་བསྐོར་བ། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་པོས་བསྐོར་བ། དབང་ཕྱུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། ཚངས་པ་དང་། ལྷའི་བུ་དང་། སྲེད་མེད་ཀྱི་བུ་དང་། དབང་ཆེན་དང་། རྒྱ་མཚོ་དང་། དགའ་བོ་དང་།
en: He was surrounded by a retinue that consisted of the seven Tārās, the ten Pāramitās, Śakra, Brahmā, Yama, Varuṇa, Kubera, the divine sons Īśvara, Maheśvara, Brahmā, Nārāyaṇa, and Maheśvara, and the nāgas Sāgara, Nanda, and Upananda.

source: ཉེ་དགའ་བོ་འཁོར་དང་བཅས་པ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔར་འཁོད་ནས་མིག་མི་འཛུམས་ཤིང་བཞིན་འཛུམ་པས། མེ་ཏོག་སྣ་ཚོགས་པ་རྣམས་བཅོམ་ལྡན་འདས་ལ་འཐོར་ཏེ། འདི་ལྟ་སྟེ། མེ་ཏོག་ཤྭ་ལ་དང་། ཏ་མ་ལ་དང་། ཙམ་པ་ཀ་དང་། ཨ་ཏི་མུག་ཏ་ཀ་དང་། ཤོ་ཀཱ་བར་ཏ་ཤ་དང་། ཁ་བྱེ་འཁྱིལ་པ་དང་། གན་དྷ་ར་ཥི་ཀ་དང་། མཐོན་ཀ་དང་། མཐོན་ཀ་ཆེན་པོ་དང་། ཀ་དམ་པ་དང་། མདོག་མཛེས་པ་དང་། སུ་མ་ནྱ་ཀ་དང་། སྐུ་སྣར་དང་། ཆེར་གསལ་བ་དང་། དྲི་མེད་གཟི་བརྗིད་དང་། དྲི་དགའ་དང་། རབ་སིམ་དང་། པ་ལཱ་ཤ་དང་། ཟ་བ་དང་། མ་རཎྜ་ཀ་དང་། གཟི་བརྗིད་བསིལ་དང་། དྲི་མེད་དང་། གཟི་ཡངས་ལྡན་དང་། ཤིན་ཏུ་བསྟན་དང་། ལྷ་དགའ་དང་། ཡིད་དགའ་དང་། ཡུ་ཐི་ཀ་དང་། པདྨ་དང་། ཀུ་མུ་ད་དང་། པདྨ་དཀར་པོ་དང་། ཨུཏྤ་ལ་དང་།
en: He stood before the blessed Śākyamuni unblinking and smiling as he bestrewed the Blessed One with a variety of flowers including śālabha, sal tree blossom, champak, adhimuktaka, śāukāvarta, prasthalitāvarta, fragrant jasmine, indigo, mahānīla, burflower-tree blossoms, roca, supattrikā, trumpet tree blossoms, vipula, prabhāsa, vimala, teja, gandha, priya, prahlāda, flame-of-the-forest blossoms, keśara, māraṇḍuka, sitoja, vimala, vipula, tejovatī, supratiṣṭhita, devapriya, sumanas, yūthika, pink lotuses, white water lilies, white lotuses, blue lotuses, red lotuses, and taraṇa flowers.

source: ཨུཏྤ་ལ་དམར་པོ་དང་། ཏ་ར་ཎ་གུ་ཧྱ་དང་། གསེར་དང་། དངུལ་དང་། རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱེད་པ་ནི་མངོན་སུམ་དུ་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་གསང་བ་དོན་ཡོད་པའི་རྒྱལ་པོ་འདི་སྨྲས་སོ།
en: He worshiped the Blessed One with offerings of flowers made of base metals, gold, silver, and various wonderful jewels.

source: །དུས་གསུམ་དུ་གཤེགས་ཤིང་བཞུགས་པ་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Facing the Blessed One, Noble Avalokiteśvara then recited the secret maṇḍala of liberation, the king of amogha vidyās: “Homage to all the buddhas and bodhisattvas established throughout the three times!

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བ་རིགས་ཀྱི་དམ་ཚིག་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to their corresponding secret family samayas!

source: །རིག་སྔགས་ཀྱི་རྒྱལ་པོ་དོན་ཡོད་པ་རྣམ་པར་ཐར་བའི་དཀྱིལ་འཁོར་ཀྱི་རིགས་དང་། ཕྱག་རྒྱ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the king of all vidyās, to the amogha maṇḍala of liberation, and to the family mudrās!

source: འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་རང་སངས་རྒྱས་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །ཡང་དག་པར་རྟོགས་པ་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the pratyekabuddhas, and to the congregations of noble śrāvakas of the past, present, and future!

source: །བློ་གྲོས་ཆེན་པོ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Śāradvatīputra, the great master of generosity!

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་སོགས་པ་འཕགས་པའི་ཚོགས་ཀྱི་མཆོག་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the sublime hosts of the most distinguished great bodhisattvas headed by Noble Maitreya!

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ཕྱག་འཚལ་ལོ། །དྲང་སྲོང་ཆེན་པོ་དེ་དག་དང་།
en: Homage to Noble Avalokiteśvara, the most compassionate, great bodhisattva being! Homage to these great sages, the most distinguished among the hosts of the noble ones! Homage to them! “

source: འཕགས་པའི་ཚོགས་ཀྱི་མཆོག་དེ་དག་ལ་ཕྱག་འཚལ་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞལ་ནས་བྱུང་བ།
en: Having thus paid homage, I will now recite the Amogharāja, the heart essence of the maṇḍala of liberation, that originated from the mouth of Noble Avalokiteśvara.

source: དོན་ཡོད་པའི་རྒྱལ་པོ་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་གྱི་སྙིང་པོ་དེ་བཞིན་གཤེགས་པས་མངོན་སུམ་དུ་གསུངས་པ་འདི་འཁོར་མང་པོའི་ནང་དུ་བདག་གིས་ད་བཟླས་ཀྱིས།
en: I will pronounce it here it in front of the Tathāgata, in the midst of this great assembly. May those who guard the treasure trove of morality accomplish the entire maṇḍala of vidyās.

source: བདག་གི་དགོས་པ་ཐམས་ཅད་གྲུབ་པར་གྱུར་ཅིག།
en: May they succeed in all their endeavors!

source: འཇིགས་པ་ཐམས་ཅད་དུ་སྲུང་བར་གྱུར་ཅིག། །།ཏདྱ་ཐཱ། ཨོཾ་ཙ་ར་ཙ་ར། ཙི་རི་ཙི་རི། ཙུ་རུ་ཙུ་རུ།
en: May my protection deliver them from every danger!

source: མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ། བི་རི་བི་རི། པི་རི་པི་རི། ཙི་རི་ཙི་རི།
en: The mantra is: [310] “Oṁ, cara cara, ciri ciri, curu curu, O most compassionate one!

source: པ་ར་མ་མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ། སི་རི་སི་རི། ཙི་རི་ཙི་རི།
en: Ciri ciri,piri piri, ciri ciri, O most compassionate one!

source: པི་རི་པི་རི། བི་རི་བི་རི། མ་ཧཱ་པདྨ་ཧ་སྟ།
en: Siri siri, ciri ciri, piri piri, ciri ciri, O great being with a lotus in your hand!

source: ཀ་ལ་ཀ་ལ། ཀི་ལི་ཀི་ལི། ཀུ་ལུ་ཀུ་ལུ། མ་ཧཱ་ཤུད་དྷ།
en: Kala kala, kili kili, kulu kulu, O great pure being!

source: ས་ཏྭ། ཨེཧྱེ་ཧི་བུད་དྷྱ་བུད་དྷྱ།
en: Come, come!

source: དྷཱ་བ་དྷཱ་བ།
en: Awaken, awaken!

source: ཀི་ཎི་ཀི་ཎི། ཀུ་ཎུ་ཀུ་ཎུ། པ་ར་མ་ཤུད་དྷ་སཏྭ།
en: Kala kala, kili kili, kulu kulu, O supremely pure being!

source: ཀ་ར་ཀ་ར། ཀི་རི་ཀི་རི།
en: Kara kara, kiri kiri!

source: ཀུ་རུ་ཀུ་རུ།
en: Act, act, you who attained great fortitude!

source: མ་ཧཱ་སྠ་མ་པྲཱཔྟ། ཙ་ལ་ཙ་ལ། སཉྩ་ལ། སཉྩ་ལ།
en: Move, move!

source: བི་ཙ་ལ། བི་ཙ་ལ།
en: Move together and move separately!

source: ཨེ་ཊ་ཊ། ཨེ་ཊ་ཊ།
en: Move forward, move forward!

source: བྷ་ར་བྷ་ར། བྷི་རི་བྷི་རི། བྷུ་རུ་བྷུ་རུ།
en: Bhara bhara, bhiri bhiri, bhuru bhuru!

source: ཨེ་ཧྱེ་ཧི་མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ།
en: Come, come, O most compassionate one!

source: མ་ཧཱ་པ་ཤུ་པ་ཏི། བེ་ཥ་དྷ་ར།
en: O wearer of the great garb of Paśupati, wear, wear!

source: ས་ར་ས་ར། ཙ་ར་ཙ་ར།
en: Act, act!

source: ཧ་ར་ཧ་ར། ཧཱ་ཧཱ་ཧཱ་ཧཱ།
en: Seize, seize!

source: ཧཱི་ཧཱི་ཧཱི་ཧཱི། ཧཱུ་ཧཱུ་ཧཱུ་ཧཱུ། ཨོྃ་ཀཱ་ར་བྲཧྨ་བེ་ཥ་དྷ་ར།
en: Hā hā, hā hā, hī hī, hī hī, hūṁ hūṁ, hūṁ hūṁ!

source: ས་ར་ས་ར། པ་ར་པ་ར། ཙ་ར་ཙ་ར།
en: Cross, cross!

source: བྷ་ར་བྷ་ར། རཤྨི་ཤ་ཏ་ས་ཧ་སྲ་པྲ་ཏི་མཎྜི་ཏ་ཤ་རཱི་ར།
en: Move, move!

source: ཛྭ་ལ་ཛྭ་ལ། ཏ་པ་ཏ་པ། བྷ་ཏ་བཱ་ན།
en: Para para!

source: སཽ་མ་ཨཱ་དི་ཏྱ། ཡ་མ།
en: Act, act!

source: བྲཧྨ།
en: To you, whose body is beautifully adorned with hundreds of thousands of lovely light rays, blaze, blaze!

source: ཨིནྡྲ། རི་ཥི། དེ་བ་ག་ཎ།
en: Heat up, heat up, O Lord!

source: སུ་རུ་སུ་རུ། ཙུ་རུ་ཙུ་རུ། པུ་རུ་པུ་རུ། མུ་རུ་མུ་རུ། ས་ནད་ཀུ་མཱ་ར།
en: Muka muka, cuka cuka, puru puru, muru muru!

source: རུ་དྲ་བཱ་ས་བ།
en: You wear a great variety of guises, such as those of Sanatkumāra, Rudra, Vāsava, Viṣṇu, Dhanada, and Vināyaka, the leader of celestial sages.

source: བིཋྞུ། དྷ་ན་དཱ། བཱ་ཡུ། དེ་བ་རྀ་ཥི་ནཱ་ཡ་ཀ། བི་ནཱ་ཡ་ཀ། བ་ཧུ་བི་བི་དྷ་བེ་ཥ་དྷ་ར།
en: Dhara dhara, dhiri dhiri, dhuru dhuru!

source: ཐ་ར་ཐ་ར། གྷ་ར་གྷ་ར།
en: Seize, seize!

source: ཡ་ར་ཡ་ར། ལ་ར་ལ་ར། ཧ་ར་ཧ་ར། མ་ར་མ་ར། པ་ར་པ་ར།
en: Mara mara, para para!

source: ཙ་ར་ཙ་ར། བ་ར་བ་ར། བ་ར་དཱ་ཡ་ཀ། ས་མནྟ་ཨ་བ་ལོ་ཀི་ཏེ།
en: Act, act!

source: བི་ལོ་ཀི་ཏེ།
en: Vara vara, O boon giver!

source: ལོ་ཀེ་ཤྭ་ར། མ་ཧེ་ཤྭ་ར། མུ་ཧུ་མུ་ཧུ། མུ་རུ་མུ་རུ། མུ་ཡ་མུ་ཡ།
en: O lokeśvara with panoptic vision, the great lord of gazes, muku muku, muru muru, muya muya, rescue, rescue, O Lord!

source: མུཉྩ་མུཉྩ།། །།
en: O Noble Avalokiteśvara!

source: བཅོམ་ལྡན་འདས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བདག་དང་སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་ཐམས་ཅད་དང་། གནོད་པ་ཐམས་ཅད་དང་། ཡམས་ཀྱི་ནད་ཐམས་ཅད་དང་།
en: Protect, protect me and all beings who guard their treasure trove of morality!

source: གདོན་ཐམས་ཅད་དང་། ནད་ཐམས་ཅད་ལས་བསྲུང་དུ་གསོལ། བསྲུང་དུ་གསོལ། གནོད་པ་དང་། འཆིང་བ་དང་། བརྡེག་པ་དང་། བསྡིགས་པ་དང་། རྒྱལ་པོ་དང་། ཆོམ་རྐུན་དང་།
en: Protect them from all dangers, misfortunes, calamities, grahas, and disease!

source: གནོད་བྱེད་དང་། མེ་དང་། ཆུ་དང་། དུག་དང་། མཚོན་ལས་ཡོངས་སུ་ཐར་བར་མཛད་པ།
en: You rescue beings from killing, imprisonment, beatings, threats, king’s villains, robbers, fire, water, poison, and weapons.

source: ཀ་ཎ་ཀ་ཎ། ཀི་ཎི་ཀི་ཎི། ཀུ་ཎུ་ཀུ་ཎུ། ཙ་ར་ཙ་ར། ཨིནྡྲི་ཡ།
en: Kaṇa kaṇa, kiṇi kiṇi, kuṇu kuṇu, act, act!

source: བ་ལ་བོ་དྷྱང་ག།
en: You teach about the sense faculties, the strengths, the limbs of awakening, and the four truths of the noble ones.

source: མཱརྒ་ཀ། ཙ་ཏུ་རཱ་རྱ་སཏྱ། སམ་པྲ་ཀཱ་ཤ་ཀ། ཏ་མ་ཏ་མ།
en: Tama tama!

source: ད་མ་ད་མ། ཤ་མ་ཤ་མ། ས་མ་ས་མ། མ་ཧཱ་ཏ་མོ྅ནྡྷ་ཀཱ་ར། བི་དྷ་མན།
en: Tame, tame!

source: ཥ་ཊ་པཱ་ར་མི་ཏཱ། པ་རི་པཱུ་ར་ཀ །
en: Sama sama, masa masa!

source: མི་ལི་མི་ལི། ཊ་ཊ་ཊ་ཊ། ཋ་ཋ་ཋ་ཋ། ཊི་ཊི་ཊི་ཊི། ཊུ་ཊུ་ཊུ་ཊུ། ཋི་ཋི་ཋི་ཋི།
en: O great being who dispels the darkness of ignorance and fulfills the six perfections, mili mili, ṭaṭa ṭaṭa, ṭhaṭha ṭhaṭha, ṭiṭi ṭiṭi, ṭuṭu ṭuṭu, ṭhiṭhi ṭhiṭhi, ṭhuṭhu ṭhuṭhu!

source: ཋུ་ཋུ་ཋུ་ཋུ། ཨེ་ནེ་ཡ་ཙ་ར་མ་ཀྲི་ཊ། པ་རི་ཀ་ར།
en: You who wear a tunic of black antelope skin, come, come!

source: ཨེ་ཧྱེ་ཧི་མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ་མ་ཧེ་ཤྭ་ར།
en: You crush the hosts of great bhūtas, including Īśvara and Maheśvara.

source: མ་ཧཱ་ཏ་བྷུ་ཏ། ག་ན་བྷཉྫ་ཀ། ཀུ་རུ་ཀུ་རུ།
en: Act, act!

source: པ་ར་པ་ར། ཀ་ཊ་ཀ་ཊ། མ་ཊ་མ་ཊ། བི་ཤུད་དྷ། བི་ཥ་ཡ། ནི་བཱ་ས་ནི།
en: Para para, kaṭa kaṭa, maṭa maṭa!

source: མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ། ཤྭེ་ཏ་ཡཛྙོ་པ་བཱི་ཏ་ཡ།
en: You inhabit the pure domain, O most compassionate one!

source: རཏྣ་མ་ཀུ་ཊ། མཱ་ལཱ་དྷ་ར།
en: You wear a white sacred thread and a crown adorned with a row of jewels.

source: སརྦ་ཛྙཱ་ཤི་ར་སི་ཀྲྀ་ཏ། ཛ་ཊཱ་མ་ཀུ་ཊ་མ་ཧཱ་ཏ་བྷུ་ཏ།
en: O omniscient one with a diadem upon your head!

source: ཀ་མ་ལ་ཀྲྀ་ཏ།
en: The palms of your exquisite hands are like lotuses.

source: ཀ་ར་ཏ་ལ་དྷྱཱ་ན་ས་མཱ་དྷི། བི་མོ་ཀྵ།
en: O diamond being, unshakable in your liberating meditative concentration and samādhi!
